#===============================================================================
# インポートモジュール
#===============================================================================
import os
import openpyxl
#===============================================================================
# グローバル変数
#===============================================================================
#エクセルファイルの名前を設定
excel_name = 'sample.xlsx'
#エクセルファイルのディレクトリパスを作成
excel_path = os.path.join(os.path.dirname(__file__), excel_name)
#ワークブックオブジェクトを作成
wb = openpyxl.Workbook()
#===============================================================================
# 主処理
#===============================================================================
#新規ファイルを作成
def Create():
    #ワークブックオブジェクトを作成
    wb = openpyxl.Workbook()

def Write_Cell():
    # ブックを取得
    book = openpyxl.load_workbook(excel_path)
    # シートを取得
    sheet = book['Sheet']
    # セルへ書き込む
    sheet.cell(row=1,column=1).value = 'ナンバー'
    sheet.cell(row=1,column=2).value = 100

def Excel_Save():
    #保存
    wb.save(excel_path)
#===============================================================================
# 関数
#===============================================================================
#新規エクセルシートを作成
Create()
Excel_Save()
Write_Cell()
Excel_Save()
